# Домашнее задание к занятию «Сеть и сетевые протоколы. VPN»
<br>

> ### Задание. Создание дополнительного офиса и настройка ISAKMP-туннеля для согласования параметров протокола.
> Описание задания  
> Руководство решило открыть новый филиал в соседней области. Перед вами стоит задача между главным офисом и филиалом создать VPN-туннель. Новый филиал подключен к тому же интернет-провайдеру. Но имеет другие “белые” ip-адреса для подключения: 87.250.0.0/30
>
> Требование к результату
> *	Вы должны отправить файл .pkt с выполненным заданием
> *	К выполненной задаче добавьте скриншоты с доступностью “внешней сети” и ответы на вопросы.
>
> Процесс выполнения
> 1.	Запустите программу Cisco Packet Tracer
> 2.	В программе Cisco Packet Tracer загрузите предыдущую практическую работу.
> 3.	На маршрутизаторе интернет-провайдера добавьте в модуль физически порты GLC-TE, предварительно его выключив.
> 4.	Создайте сеть нового филиала, состоящую из 3 ПК, 1 коммутатора и 1 маршрутизатора.
> 5.	Создайте сетевую связность между маршрутизатором филиала и маршрутизатором интернет-провайдера, согласно условиям.
> 6.	На маршрутизаторе филиала создайте NAT-трансляцию с помощью access-листов для внутренней сети. Адресацию внутри сети филиала можно использовать любую.
> 7.	На маршрутизаторе главного офиса настройте политики ISAKMP:
>
> *R1(config)# crypto isakmp policy 1  
> R1(config-isakmp)# encr 3des - метод шифрования  
> R1(config-isakmp)# hash md5 - алгоритм хеширования  
> R1(config-isakmp)# authentication pre-share - использование предварительного общего ключа (PSK) в качестве метода проверки подлинности  
> R1(config-isakmp)# group 2 - группа Диффи-Хеллмана, которая будет использоваться  
> R1(config-isakmp)# lifetime 86400 - время жизни ключа сеанса*  
>
> 8.	Укажите Pre-Shared ключ для аутентификации с маршрутизатором филиала. Проверьте доступность с любого конечного устройства доступность роутера интернет-провайдера, командой ping.
> 9.	Создайте набор преобразования (Transform Set), используемого для защиты наших данных.  
>
> *crypto ipsec transform-set <название> esp-3des esp-md5-hmac*
>
> 10.	Создайте крипто-карту с указанием внешнего ip-адреса интерфейса и привяжите его к интерфейсу.  
>
> *R1(config)# crypto map <название> 10 ipsec-isakmp  
> R1(config-crypto-map)# set peer  
> R1(config-crypto-map)# set transform-set <название>  
> R1(config-crypto-map)# match address <название access-листа>  
> R1(config- if)# crypto map <название крипто-карты>*  
>
> 11.	Проделайте вышеуказанные операции на маршрутизаторе филиала в соответствии ip-адресов и access-листов и отключите NAT-трансляцию сетевых адресов.
> 12.	Проверьте сетевую доступность между роутерами командой ping.
> 13.	Проверьте установившееся VPN-соединение на каждом роутере командой: “show crypto session”. Статус должен быть UP-ACTIVE. Сделайте скриншот.
>
> Топология после выполнения задания должна выглядеть следующим образом:
>
> <kbd><img src="/img/net-7.1.1.png"></kbd>
> 
> Критерии оценки
> 1.	Задание выполнено полностью.
> 2.	К заданию прикреплены скриншоты статусов VPN-соединений и доступности сетей двух офисов.
> 3.	Отображены настройки конфигурации VPN.
>
### Ответ к заданию.
**Ссылка на файл \*.PKT:**  
https://github.com/rappture/sys-19/blob/main/conf/net-7/VPN.pkt

:large_blue_diamond:	На рисунке ниже добавление модуля GLC-TE в роутер провайдера.

<kbd><img src="/img/net-7.1.2.png"></kbd>
 
:large_blue_diamond:	На рисунке ниже настройки портов и маршрутов для роутера провайдера, роутера и свитча нового филиала.

<kbd><img src="/img/net-7.1.3.png"></kbd>
 
:large_blue_diamond:	На рисунке ниже создание NAT-трансляции с помощью access-листов для внутренней сети на маршрутизаторе филиала.

<kbd><img src="/img/net-7.1.4.png"></kbd>
 
:large_blue_diamond:	На рисунке ниже настройки конфигурации VPN.

<kbd><img src="/img/net-7.1.5.png"></kbd>
 
:large_blue_diamond:	На рисунке ниже отключение * NAT на роутерах нового филиала и главного офиса.

<kbd><img src="/img/net-7.1.6.png"></kbd>
 
:large_blue_diamond:	На рисунках ниже «общение» между роутерами по ISAKMP и IPSec, а также структура пакета с запросом ping-a до и после прохождения роутера нового филиала.

<kbd><img src="/img/net-7.1.7.png"></kbd>
 
<kbd><img src="/img/net-7.1.8.png"></kbd>
 
:large_blue_diamond:	К сожалению, в Cisco PT команда «show crypto session» недоступна (см. рисунок ниже).

<kbd><img src="/img/net-7.1.9.png"></kbd>
 
<details>
<summary><h3>N.B.</h3></summary>

**Заметки для себя**

:green_book:	* Вместо полного отключения NAT обычно добавляют исключения в access-list (ACL), используемый для NAT:

<kbd><img src="/img/net-7.extra.1.png"></kbd>
 
:green_book:	Текстом настройки VPN:

```
RO1_MAIN_OFFICE>en
Password: 
ping 87.250.0.2
RO1_MAIN_OFFICE#conf t
Enter configuration commands, one per line. End with CNTL/Z.
RO1_MAIN_OFFICE(config)#crypto isakmp policy 1
RO1_MAIN_OFFICE(config-isakmp)#encr 3des
RO1_MAIN_OFFICE(config-isakmp)#hash md5
RO1_MAIN_OFFICE(config-isakmp)#authentication pre-share
RO1_MAIN_OFFICE(config-isakmp)#group 2
RO1_MAIN_OFFICE(config-isakmp)#lifetime 86400
RO1_MAIN_OFFICE(config-isakmp)#crypto isakmp key serenity address 87.250.0.2
RO1_MAIN_OFFICE(config)#ip access-list extended R1-acl-vpn
RO1_MAIN_OFFICE(config-ext-nacl)#permit ip 192.168.0.0 0.0.0.15 192.168.40.0 0.0.0.15
RO1_MAIN_OFFICE(config-ext-nacl)#exit
RO1_MAIN_OFFICE(config)#crypto ipsec transform-set R1-ts-vpn esp-3des esp-md5-hmac
RO1_MAIN_OFFICE(config)#crypto map R1-cmap-vpn 10 ipsec-isakmp
% NOTE: This new crypto map will remain disabled until a peer
and a valid access list have been configured.
RO1_MAIN_OFFICE(config-crypto-map)#set peer 87.250.0.2
RO1_MAIN_OFFICE(config-crypto-map)#set transform-set R1-ts-vpn
RO1_MAIN_OFFICE(config-crypto-map)#match address R1-acl-vpn
RO1_MAIN_OFFICE(config-crypto-map)#exit
RO1_MAIN_OFFICE(config)#int gi 0/0/0
RO1_MAIN_OFFICE(config-if)#crypto map R1-cmap-vpn
*Jan 3 07:16:26.785: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is ON
RO1_MAIN_OFFICE(config-if)#exit
RO1_MAIN_OFFICE(config)#exit
RO1_MAIN_OFFICE#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
RO1_MAIN_OFFICE#
```
```
R_branch_office>en
ping 188.144.0.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 188.144.0.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/0 ms

R_branch_office#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R_branch_office(config)#crypto isakmp policy 1
R_branch_office(config-isakmp)#encr 3des
R_branch_office(config-isakmp)#hash md5
R_branch_office(config-isakmp)#authentication pre-share
R_branch_office(config-isakmp)#group 2
R_branch_office(config-isakmp)#lifetime 86400
R_branch_office(config-isakmp)#crypto isakmp key serenity address 188.144.0.2
R_branch_office(config)#ip access-list extended R3-acl-vpn
R_branch_office(config-ext-nacl)#permit ip 192.168.40.0 0.0.0.15 192.168.0.0 0.0.0.15
R_branch_office(config-ext-nacl)#exit
R_branch_office(config)#crypto ipsec transform-set R3-ts-vpn esp-3des esp-md5-hmac
R_branch_office(config)#crypto map R3-cmap-vpn 10 ipsec-isakmp
% NOTE: This new crypto map will remain disabled until a peer
and a valid access list have been configured.
R_branch_office(config-crypto-map)#set peer 188.144.0.2
R_branch_office(config-crypto-map)#set transform-set R3-ts-vpn
R_branch_office(config-crypto-map)#match address R3-acl-vpn
R_branch_office(config-crypto-map)#exit
R_branch_office(config)#int gi 0/0/0
R_branch_office(config-if)#crypto map R3-cmap-vpn
*Jan 3 07:16:26.785: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is ON
R_branch_office(config-if)#exit
R_branch_office(config)#exit
R_branch_office#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
R_branch_office#
```
</details>
